package com.dongjin.hospitalapp.model

val regionFilterMap = mapOf(
    "서울" to listOf(
        "110001" to "강남구", "110002" to "강동구", "110003" to "강서구", "110004" to "관악구",
        "110005" to "구로구", "110006" to "도봉구", "110007" to "동대문구", "110008" to "동작구",
        "110009" to "마포구", "110010" to "서대문구", "110011" to "성동구", "110012" to "성북구",
        "110013" to "영등포구", "110014" to "용산구", "110015" to "은평구", "110016" to "종로구",
        "110017" to "중구", "110018" to "송파구", "110019" to "중랑구", "110020" to "양천구",
        "110021" to "서초구", "110022" to "노원구", "110023" to "광진구", "110024" to "강북구",
        "110025" to "금천구"
    ),
    "경기북부" to listOf(
        "310200" to "동두천시", "311800" to "오산시", "312800" to "포천시", "311000" to "구리시",
        "311500" to "남양주시", "312900" to "여주시", "310009" to "양평군", "311100" to "안산시",
        "311200" to "평택시", "312200" to "파주시", "311600" to "의왕시"
    ),
    "경기남부" to listOf(
        "312000" to "용인시", "312500" to "화성시", "311300" to "하남시", "311400" to "군포시",
        "311700" to "시흥시", "311900" to "고양시", "310600" to "수원시", "310701" to "안양만안구",
        "310702" to "안양동안구", "311800" to "오산시"
    ),
    "부산" to listOf(
        "210001" to "부산남구", "210002" to "부산동구", "210003" to "부산동래구", "210004" to "부산진구",
        "210005" to "부산북구", "210006" to "부산서구", "210007" to "부산영도구", "210008" to "부산중구",
        "210009" to "부산해운대구", "210010" to "부산사하구", "210011" to "부산금정구",
        "210012" to "부산강서구", "210013" to "부산연제구", "210014" to "부산수영구", "210015" to "부산사상구"
    ),
    "대구경북" to listOf(
        "230001" to "대구남구", "230002" to "대구동구", "230003" to "대구북구",
        "370200" to "구미시", "370300" to "김천시", "370100" to "경주시"
    ),
    "전북" to listOf(
        "350100" to "군산시", "350300" to "익산시", "350400" to "전주시",
        "350500" to "정읍시", "350600" to "김제시"
    ),
    "전남" to listOf(
        "360300" to "목포시", "360400" to "순천시", "360500" to "여수시",
        "360700" to "광양시", "360200" to "나주시"
    ),
    "강원" to listOf(
        "320100" to "강릉시", "320300" to "속초시", "320400" to "원주시", "320500" to "춘천시"
    ),
    "충북" to listOf(
        "330100" to "청주시", "330200" to "충주시", "330300" to "제천시"
    ),
    "대전충남" to listOf(
        "250001" to "대전유성구", "250003" to "대전서구", "340200" to "천안시",
        "340400" to "보령시", "340500" to "아산시"
    ),
    "제주" to listOf(
        "390100" to "서귀포시", "390200" to "제주시"
    )
)
